tutorialsOld/surfaceTracking/interTrackMHDmagFoam/rgs2D/0.org/region_fluid/fluidIndicator
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      fluidIndicator;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    trackedSurface
    {
        type            zeroGradient;
    }
    movingWall
    {
        type            zeroGradient;
    }
    fixedWall
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
    "procBoundary.*"
    {
        type            processor;
        value           uniform 1;
    }
}


// ************************************************************************* //
