tutorialsOld/surfaceTracking/interTrackMHDmagFoam/rgs2D/0.org/sigma
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      sigma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [-1 -3 3 0 0 2 0];

internalField   uniform 0;

boundaryField
{
    infinity
    {
        type            calculated;
        value           $internalField;
    }
    frontAndBack
    {
        type            empty;
    }
    "procBoundary.*"
    {
        type            processor;
        value           uniform 0;
    }
}

// ************************************************************************* //
